src/Catalogs/кпкМатрицаТоваров/кпкМатрицаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кпкМатрицаТоваров</name>
  <comment>Матрица товаров</comment>
  <attributes>
    <name>НачПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.кпкКатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРейтинги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейтинг</name>
      <type>
        <types>CatalogRef.кпкРейтингиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРейтинга</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Агенты</name>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кпкМатрицаТоваров/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	кпкМатрицаТоваров.Код,
	|	кпкМатрицаТоваров.Наименование,
	|	кпкМатрицаТоваров.НачПериода,
	|	кпкМатрицаТоваров.КонПериода
	|ИЗ
	|	Справочник.кпкМатрицаТоваров КАК кпкМатрицаТоваров
	|ГДЕ
	|	кпкМатрицаТоваров.Категория = &Категория
	|	И ВЫБОР
	|			КОГДА кпкМатрицаТоваров.НачПериода = &ПустаяДата
	|				ТОГДА кпкМатрицаТоваров.КонПериода >= &НачПериода
	|			ИНАЧЕ ВЫБОР
	|					КОГДА кпкМатрицаТоваров.КонПериода = &ПустаяДата
	|						ТОГДА кпкМатрицаТоваров.НачПериода <= &КонПериода
	|					ИНАЧЕ кпкМатрицаТоваров.НачПериода МЕЖДУ &НачПериода И &КонПериода
	|							ИЛИ кпкМатрицаТоваров.КонПериода МЕЖДУ &НачПериода И &КонПериода
	|				КОНЕЦ
	|		КОНЕЦ
	|	И кпкМатрицаТоваров.Состав.Номенклатура В(&СписНоменклатуры)
	|	И кпкМатрицаТоваров.Ссылка <> &ТекМатрица");	
	
	Запрос.УстановитьПараметр("ТекМатрица", 	  Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", 	  '00010101');
	Запрос.УстановитьПараметр("НачПериода", 	  НачПериода);
	Запрос.УстановитьПараметр("КонПериода", 	  КонПериода);
	Запрос.УстановитьПараметр("Категория",        Категория);
	Запрос.УстановитьПараметр("СписНоменклатуры", Состав.ВыгрузитьКолонку("Номенклатура"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("На заданный период уже есть матрица для категории """ + Категория + """ с пересекающимися позициями номенклатуры!");
		
		Если ЗначениеЗаполнено(Выборка.КонПериода) Тогда		
			ТекстПериода = ПредставлениеПериода(НачалоДня(Выборка.НачПериода), КонецДня(Выборка.КонПериода));		
		Иначе		
			ТекстПериода = Формат(Выборка.НачПериода, "ДФ=dd.MM.yyyy") + "-";		
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьОбОшибке("Смотрите матрицу товаров с названием """ + СокрЛП(Выборка.Наименование) + """ за " + ТекстПериода);
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры
